<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Memoria</title>
<link href="estilo.css" rel="stylesheet" type="text/css" />
<style type="text/css">
<!--
body {
	background-image: url(1174_Puente-en-la-ciudad.jpg);
}
-->
</style>
<link href="Estilo/estilo.css" rel="stylesheet" type="text/css" />
<style type="text/css">
<!--
.Estilo3 {color: #F0F0F0}
.Estilo4 {color: #000000}
.Estilo5 {color: #CC3300}
.Estilo8 {
	color: #000066;
	font-weight: bold;
}
.Estilo12 {color: #000066}
-->
</style>
</head>

<body>
<p><a href="principal.html">VOLVER A PAGINA PRINCIPAL </a></p>
<p>&nbsp;</p>
<p><a href="#0">0. <strong>Funcionamiento del juego </strong></a></p>
<p>Ir al trabajo realizado por: </p>
<p><a href="#2h">1. <strong>Jose Vicente Casanova Fern&aacute;ndez,  responsable del desarrollo en el entorno Flash del proyecto.</strong></a></p>
<p><a href="#2">2. <strong>Javier Fern&aacute;ndez Vivancos, responsable de los contenidos de texto, animaci&oacute;n y
v&iacute;deo del proyecto.</strong></a></p>
<p><a href="#3">3. <strong>Juan Francisco Cascales Gac&iacute;a, responsable de los contenidos de imagen y audio del proyecto.</strong></a></p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<h1><strong><a name="0" id="0"></a>0. Funcionamiento del juego </strong></h1>
<p><br />
</p>
<p> Se nos ocurri&oacute; hacer personajes distintos para que al comenzar el juego puedas  elegir con qui&eacute;n deseas participar en el juego &quot;Las tres jotas&quot; y un  presentador (al estilo 
  Ram&oacute;n Garc&iacute;a) que est&eacute; todas las veces que concurses y que se alegre o se  enfade 
  seg&uacute;n tu suerte en el juego.</p>
<p>La pagina del juego contiene el archivo flash donde se podr&aacute; jugar y participar en  las &quot;Tres Jotas&quot;, dicho nombre se debe a que los nombres de los 3 desarrolladores que lo han creado empiezan por &quot;J&quot; que es, </p>
<p>basicamente, un 50x15, pero decidimos cambiar el nombre porque, los tres nombres de los desarrolladores de este juego, empiezan por &quot;J&quot;.</p>
<h1 class="Estilo3"><span class="Estilo4"><a name="2h" id="2h"></a></span><span class="Estilo5">1. Jose Vicente Casanova Fern&aacute;ndez,  responsable del desarrollo en el entorno Flash del proyecto.</span></h1>
<p><strong><a href="#1.1">1.1 Desarrollo en Dreamweaver </a></strong></p>
<p><strong><a href="#1.1.1">1.1.1 P&aacute;gina web</a></strong></p>
<p><strong><a href="#1.1.2">1.1.2 fichero XML </a></strong></p>
<p><strong><a href="#1.2">1.2 Desarrollo en entonrno Flash</a></strong></p>
<p><strong><a href="#1.2.1">1.2.1 Estructura del entorno</a></strong></p>
<p><strong><a href="#1.2.2">1.2.2 Instrucciones utilizadas para el control y correcto flujo del entorno.</a></strong></p>
<p><a href="#1.3"><strong>1.3 Contenidos de animaci&oacute;n e imagen realizados </strong></a></p>
<p><a href="#1.4">1.4 Anotaciones y problemas que han surgido </a></p>
<p>&nbsp;</p>
<h1><strong><a name="1.1" id="1.1"></a>1.1 Desarrollo en Dreamweaver: </strong></h1>
<p>Con Dreamweaver, <span class="Estilo8">Jose Vicente Casanova Fern&aacute;ndez  ha realizado tanto el desarrollo del XML</span> que contiene la estructura del juego, <span class="Estilo8">como  la p&aacute;gina web</span>, todo ello recogido en un sitio. Este sitio contiene las preguntas que se realizar&aacute;n en formato .xml, la pel&iacute;cula flash en formato .swf, la hoja de estilos de la p&aacute;gina en formato .css, la(s) p&aacute;gina(s) web(s) en formato .html, adem&aacute;s de todos los v&iacute;deos, sonidos e im&aacute;genes del juego; todos estos componentes deben estar presentes para el correcto funcionamiento de la pr&aacute;ctica. </p>
<p><a href="#2h">Subir</a></p>
<p>&nbsp;</p>
<h1><strong><a name="1.1.1" id="1.1.1"></a>1.1.1 P&aacute;gina web:</strong></h1>
<p><span class="Estilo8">El apartado web</span> del proyecto <span class="Estilo8">est&aacute; dividido en 2 p&aacute;ginas</span> diferentes:</p>
<p><span class="Estilo8">- La p&aacute;gina de inicio:</span> Contiene entre otras cosas una imagen de sustituci&oacute;n, la cual <span class="Estilo8">sirve de enlace hacia la p&aacute;gina principal </span></p>
<p><span class="Estilo8">- La p&aacute;gina principal:</span>  Contiene distintos botones para dar un aspecto de <span class="Estilo8">men&uacute; principal</span>; este men&uacute; contiene un enlace para volver a la p&aacute;gina de inicio, otro para inicializar el juego y otro para acceder a la p&aacute;gina actual (la memoria).</p>
<p> La p&aacute;gina para inicializar el juego contiene el archivo flash donde se podr&aacute; jugar y participar en  las &quot;Tres Jotas&quot;</p>
<p>La pagina de la memoria es en la que nos encontramos, la cual contiene el trabajo realizado por cada uno de los compenentes. </p>
<p><span class="Estilo8">Todas estas p&aacute;ginas comparten una misma hoja de estilos</span>, con el fin de dar un aspecto de uniformidad a la p&aacute;gina. </p>
<p><a href="#2h">Subir</a></p>
<p>&nbsp;</p>
<h1><strong><a name="1.1.2" id="1.1.2"></a>1.1.2 fichero XML </strong></h1>
<p><span class="Estilo8">Este fichero posee</span>, entre otras cosas, <span class="Estilo8">las preguntas que se formular&aacute;n a lo largo del juego</span>, tambi&eacute;n contiene informaci&oacute;n particular sobre cada una de estas preguntas, como por ejemplo el nivel que tiene cada una de ellas, la url (archivo de audio, imagen o v&iacute;deo) que va asociado a cada una, as&iacute; como las 4 posibles respuestas que podr&aacute; tener (de las cuales s&oacute;lo una ser&aacute; correcta), la opci&oacute;n correcta y un identificador.</p>
<p><span class="Estilo8">Esta forma de cargar las preguntas del XML nos facilita</span> enormemente la tarea de <span class="Estilo8">ampliar preguntas</span> en un futuro, pues simplemente ampliando este XML el juego es capaz de reconocerlas y tratarlas, esto hace que el juego sea bastante flexible en este asp&eacute;cto, ampliando los l&iacute;mites de &eacute;ste. </p>
<p><a href="#2h">Subir</a></p>
<p>&nbsp;</p>
<h1><strong><a name="1.2" id="1.2"></a>1.2 Desarrollo en entonrno Flash</strong></h1>
<p><span class="Estilo8">El desarrollo de programaci&oacute;n</span> dentro del entorno Flash <span class="Estilo8">ha sido realizado</span> en su totalidad <span class="Estilo8">por Jose Vicente Casanova Fern&aacute;ndez</span>, utilizando  para ello el lenguaje que incorpora dicho programa (Action Script).</p>
<p>Este c&oacute;digo ha sido ayudado de varios manuales buscados por internet, varios foros de flash y algunos ejemplos. Tambi&eacute;n con el manual que nos proporcion&oacute; el profesor. </p>
<p>El c&oacute;digo en Flash ha tenido que adaptarse a  nuestra filosof&iacute;a de que s&oacute;lo con a&ntilde;adir preguntas al XML el juego sea capaz de utilizarlas y as&iacute; ahorrar el trabajo de  implementar de nuevo el flash a un posible futuro desarrollador. </p>
<p>Adem&aacute;s de trabajar con el XML, y con Action Script, ha sido necesaria la creaci&oacute;n de fotogramas adicionales con mensajes hacia el usuario, en total unos <span class="Estilo8">28 fotogramas</span>, a los cuales se salta en funci&oacute;n de las necesidades del juego; dichos fotogramas se enumeran en el apartado siguiente:</p>
<p><a href="#2h">Subir</a> </p>
<p>&nbsp;</p>
<h1><strong><a name="1.2.1" id="1.2.1"></a>1.2.1 Esctructura del entorno</strong></h1>
<p>La principal car&aacute;cter&iacute;stica de la estructura se basa en el salto a distintos fotogramas de la pel&iacute;cula en funci&oacute;n a las necesidades del desarrollo del juego, es decir: </p>
<p><span class="Estilo8">Inicialmente se presenta un fotograma con una pregunta aleatoria</span> del nivel en el que nos encontremos, (controlando que &eacute;sta no haya aparecido con anterioridad) esperando a que el usuario responda una de las 4 opciones posibles. Cuando el usuario responda podr&aacute;n producirse 2 situaciones distintas:</p>
<p><span class="Estilo8">- La primera situaci&oacute;n es que  el usuario acierte la pregunta, en este caso se saltar&aacute; a un</span> determinado fotograma (<span class="Estilo12"><strong>fotograma de acierto</strong></span>).</p>
<p><span class="Estilo8">- La segunda situaci&oacute;n es que  el usuario falle la pregunta, en este caso se saltar&aacute; a</span> otro fotograma distinto (<span class="Estilo8">fotograma de fallo</span>).</p>
<p>Todo esto est&aacute; dentro de un bucle, <span class="Estilo8">este bucle s&oacute;lo deja de repetirse en  caso de que el usuario falle la pregunta o</span> en caso de que el usuario  gane (<span class="Estilo12"><strong>responda 15 preguntas correctamente</strong></span>).</p>
<p>Ahora pasaremos a estudiar c&oacute;mo hemos conseguido el proceso anteriormente descrito, para ello detallaremos lo que ocurre en los 28 fotogramas de los que consta el juego: </p>
<p><span class="Estilo8">fotogramas 1-17:</span> Estos fotogramas se reservan para la <span class="Estilo8">elecci&oacute;n del personaje</span>, en los cuales se han introducido las animaciones realizadas por Javier, en cuanto a las acciones de estos fotogramas destacamos las de parar todos los sonidos e inicializar variables.</p>
<p><span class="Estilo8">fotograma 18:</span> Este fotograma sirve para <span class="Estilo8">informar al usuario de que se encuentra en el primer nivel,</span> incorpora un &quot;gong&quot;. Se prolonga unos 2 segundos y posteriormente <span class="Estilo8">salta al fotograma 21</span></p>
<p>fotograma 19: Tiene la misma funci&oacute;n y funcionamiento que el fotograma 18, pero en este caso para informar de que el actual nivel es el segundo.</p>
<p>fotograma 20: Idem fotogramas 18 y 19 pero con el tercer nivel.</p>
<p><span class="Estilo8">fotograma 21:</span> Este fotograma es pr&aacute;cticamente el motor del juego, en &eacute;l <span class="Estilo8">se carga el XML</span>, <span class="Estilo8">se enuncia la siguiente pregunta</span> aleatoria dentro del nivel en el que nos encontremos junto con sus posibles respuestas <span class="Estilo8">y</span> <span class="Estilo8">se carga en el centro de la pantalla una imagen o un v&iacute;deo</span>: una imagen est&aacute;tica si nos encontramos en el primer nivel, un v&iacute;deo din&aacute;mico (el cual se obtiene del XML) si estamos en el segundo nivel y una imagen din&aacute;mica (la cual se obtiene del XML) si estamos en el tercer nivel.</p>
<p><span class="Estilo8">fotogramas 22-23:</span> Aqu&iacute; <span class="Estilo8">se llama al m&eacute;todo siguientePregunta</span> (el cual se encuentra en el fotograma 21) para que se muestre en pantalla todo lo que anteriormente se ha descrito, hasta que el usuario no responda una de las 4 posibles respuestas este fotograma seguir&aacute; mostr&aacute;ndose por pantalla, una vez que el usuario responda <span class="Estilo8">se pasar&aacute; al fotograma 24 si ha acertado o al fotograma 26 si ha fallado.</span> </p>
<p><span class="Estilo8">fotograma 24:</span> Este fotograma, al igual que el fotograma 26 sirve para dar emoci&oacute;n al juego, es s&oacute;lo un <span class="Estilo8">fotograma de transici&oacute;n al fotograma 25.</span> Dura 2 segundos y en el que se ha introducido la animaci&oacute;n en la que el presentador levanta la ceja como Carlos Sobera. </p>
<p><span class="Estilo8">fotograma 25:</span> Es el fotograma que el usuario siempre desea que aparezca, &iexcl;el <span class="Estilo8">de acierto</span>!, aqu&iacute; se introducen las animaciones en las que los personajes se ponen contentos </p>
<p>fotograma 26: Este fotograma, al igual que el fotograma 24 sirve para dar emoci&oacute;n al juego, es s&oacute;lo un fotograma de transici&oacute;n al fotograma 27 el cual dura 2 segundos y en el que se ha introducido la animaci&oacute;n en la que el presentador levanta la ceja como Carlos Sobera. </p>
<p><span class="Estilo8">fotograma 27:</span> Al contrario que el fotograma 25, &eacute;ste es el que el usuario no desea, pues <span class="Estilo8">indica que ha fallado la pregunta </span>y por tanto que ha perdido el juego, en &eacute;l se han introducido las animaciones en las que los personajes se ponen tristes<span class="Estilo12"><strong>, t</strong><strong></strong></span><span class="Estilo8">iene un</span> <span class="Estilo8">enlace al primer fotograma</span> para que el usuario pueda volver a jugar de nuevo. </p>
<p><span class="Estilo8">fotograma 28:</span> El &uacute;ltimo fotograma, <span class="Estilo12"><strong>indica al usuario que ha ganado el juego</strong></span> y que ha ganado como no pod&iacute;a ser otra cosa tres jamones de jabugo de primera calidad (bueno, en realidad s&oacute;lo gana una visualizaci&oacute;n de &eacute;stos) y le ponemos musiquita animada, le introducimos las animaciones del  presentador bailando y la de su concursante alegre. </p>
<p><a href="#2h">Subir</a></p>
<p>&nbsp;</p>
<h1><strong><a name="1.2.2" id="1.2.2"></a>1.2.2 Estructura de datos e Instrucciones utilizadas para el control y correcto flujo del entorno.</strong></h1>
<p>Para poder realizar el proceso del apartado anterior se ha realizado una estructura de datos muy sencilla, de la cual destacamos los siguientes componentes:</p>
<p>El control para poder conocer si una pregunta ha aparecido o no con anterioridad se reliaza a trav&eacute;s de un vector de Strings en el cual cada una de sus posiciones corresponde con una determinada pregunta; de tal forma que si una pregunta ha aprecido ya con anterioridad, la posici&oacute;n de dicho vector que corresponde a esta pregunta tendr&aacute; el valor &quot;sin&quot; mientras que si no lo ha hecho tendr&aacute; el valor &quot;con&quot;.</p>
<p>Por &uacute;ltimo, entre las instrucciones de flujo de fotogramas que se han utilizado destacamos:</p>
<p><span class="Estilo8">GoToAndPlay():</span> salta y reproduce el fotograma que le pasemos como par&aacute;metro.</p>
<p><span class="Estilo8">Stop():</span> se detiene en el fotograma en el que est&eacute; puesta</p>
<p><span class="Estilo8">setInterval( , )</span> espera el intervalo de tiempo que se le pase como par&aacute;metro y luego sigue ejecut&aacute;ndose</p>
<p><span class="Estilo8">_root :</span> el cual nos permite acceder ha variables desde diferentes partes del codigo. </p>
<p><a href="#2h">Subir</a></p>
<p>&nbsp;</p>
<h1><a name="1.3" id="1.3"></a>1.3 Contenidos de animaci&oacute;n e imagen realizados. </h1>
<p><span class="Estilo8">Jose Vicente Casanova Fern&aacute;ndez</span> tambi&eacute;n ha realizado algunos contenidos de animaci&oacute;n e imagen, pues <span class="Estilo8">ha realizado la presentaci&oacute;n del principio </span>(todo lo que va antes de que el presentador entre caminando por la pantalla) junto con las im&aacute;genes necesarias para la creaci&oacute;n de &eacute;sta (con gimp) las cuales se describen a continuaci&oacute;n: </p>
<p>- escenario.png: Mediante un uso sencillo de rect&aacute;ngulos se han creado unas escaleras naranjas que se utilizan  tanto para la presentaci&oacute;n del principio como para el fotograma final (el 28).</p>
<p>- degradado.png: Este degradado sirve para conseguir el efecto de la presentaci&oacute;n en la que el presentador aparece poco a poco  y para la creaci&oacute;n de foco.png. </p>
<p>- focoBueno.png:  utilizando degradado.png y l&iacute;neas oblicuas en forma de tri&aacute;ngulo se ha creado el efecto del foco, pues al hacerse poco a poco mas transparente por abajo y blanco por arriba se consigue el efecto deseado.</p>
<p><span class="Estilo12"><strong>La presentaci&oacute;n utiliza interpolaciones de movimiento</strong></span> para conseguir que el degradado se mueva poco a poco hasta mostrar al presentador <span class="Estilo8">y</span>  para mostrar a los concursantes desapareciendo poco a poco. Tambi&eacute;n utiliza distintas <span class="Estilo12"><strong>im&aacute;genes que se sustituyen</strong></span> unas con otras <span class="Estilo8">al comp&aacute;s de la m&uacute;sica </span>que la animaci&oacute;n incorpora. </p>
<p><a href="#2h">Subir</a></p>
<p>&nbsp;</p>
<h1><a name="1.4" id="1.4"></a>1.4 Anotaciones y problemas que han surgido.</h1>
<p>XML:</p>
<p>El formato del XML no fue muy dificil ya que nos ayudamos de las sesiones de ejemplo que nos proporcion&oacute; el profesor, pero tuvimos muchos problemas por las tildes, concretamente en una &quot;&Iacute;&quot;, y despues de varios intentos fallidos, nos pusimos en contacto con el profesor que nos ayudo de buen grado. Tambien nos separ&oacute;  la carga en dos fotogramas, este paso no lo lleg&eacute; a comprender muy bien, pero es efectivo.</p>
<p>flash:</p>
<p>Al principio, adecuarnos al lenguaje nos cost&oacute; bastante, pero, supongo, como todo lo que empiezas desde un principio. Los accesos a diferentes niveles fueron bastantes liosos y no lo hemos utilizado casi nunca.</p>
<p>El acceso a diferentes variables desde diferentes puntos del flash, desde el codigo, tambi&eacute;n fue un punto conflictivo que resolvimos con bastante rapidez, pero nos caus&oacute; varios problemas.</p>
<p><a href="#2h">Subir</a></p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<h1><strong> <a name="2" id="2"></a>2. Javier Fern&aacute;ndez Vivancos, responsable de los contenidos de texto, animaci&oacute;n y
  v&iacute;deo del proyecto</strong></h1>
<p><strong><a href="#2.1">2.1 Contenidos de V&iacute;deo.</a></strong></p>
<p><strong><a href="#2.1.1">2.1.1 Programas utilizados para v&iacute;deo.</a></strong></p>
<p><strong><a href="#2.1.2">2.1.2 Trabajo realizado por cada v&iacute;deo. </a></strong></p>
<p><strong><a href="#2.2">2.2 Contenidos de texto.</a></strong></p>
<p><strong><a href="#2.2.1">2.2.1 Memoria.  </a></strong></p>
<p><strong><a href="#2.3">2.3 Contenidos de animaci&oacute;n. </a></strong></p>
<p><a href="#2.3.1"><strong>2.3.1 Presentaci&oacute;n del Juego</strong></a></p>
<p><strong><a href="#2.3.2">2.3.2 Escenario del juego.</a></strong></p>
<p><a href="#2.3.3"><strong>2.3.3 Personajes que aparecen </strong></a></p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<h1><strong><a name="2.1" id="2.1"></a>2.1 Contenidos de V&iacute;deo:</strong></h1>
<p><span class="Estilo8">Javier Fern&aacute;ndez Vivancos</span> <span class="Estilo8">ha realizado las 10  v&iacute;deos</span> (uno para cada pregunta) que se detallan en los apartados siguientes, algunos de ellos han sido capturados mediante c&aacute;mara de v&iacute;deo, pero dadas las bajas prestaciones de la c&aacute;mara se ha optado por trabajar con v&iacute;deos de diferentes fuentes,  se han utilizado distintos programas de retoque de v&iacute;deo para conseguir un efecto m&aacute;s profesional,  la informaci&oacute;n sobre cada pregunta se ha obtenido principalmente de la p&aacute;gina: <a href="www.wikipedia.org">www.wikipedia.org</a> y de conocimientos personales. </p>
<p><a href="#2">subir</a></p>
<p>&nbsp;</p>
<h1><strong><a name="2.1.1" id="2.1.1"></a>2.1.1 Programas utilizados para v&iacute;deo:</strong></h1>
<p><br />
  <span class="Estilo8">Download helper</span>.....................................para bajar los v&iacute;deos de youtube en formato .flv<br />
  <span class="Estilo12"><strong>avidemux</strong></span>................................................conversi&oacute;n de .flv a divX<br />
  <span class="Estilo8">windows movie maker</span>.............................montaje de pel&iacute;culas<br />
  <span class="Estilo8">pinnacle Studio plus v.9.4</span>........................montaje de pel&iacute;culas<br />
  <span class="Estilo8">virtualDub</span>...............................................conversi&oacute;n al formato final</p>
<p><a href="#2">subir</a></p>
<p>&nbsp;</p>
<h1><strong><a name="2.1.2" id="2.1.2"></a>2.1.2 Trabajo realizado por cada v&iacute;deo:</strong></h1>
<p class="Estilo8">-
  F&oacute;rmula 1: </p>
<p>v&iacute;deo original: <a href="http://www.youtube.com/watch?v=D_JJREMpsas">http://www.youtube.com/watch?v=D_JJREMpsas</a></p>
<p>  Montaje y m&uacute;sica al comp&aacute;s de la canci&oacute;n:    con pinnacle Studio</p>
<p>Inicialmente se han seleccionado las mejores escenas del v&iacute;deo original y se han guardado en clips individuales, posteriormente se ha introducido la m&uacute;sica al proyecto y en funci&oacute;n del comp&aacute;s e intensidad de &eacute;sta se han ido introduciendo los clips anteriormente guardados.</p>
<p><span class="Estilo8">Este v&iacute;deo</span> es el &uacute;nico que carece de texto al principio para indicar el deporte del que trata la pregunta, la raz&oacute;n es que se <span class="Estilo8">desea conseguir un impacto audiovisual</span> al principio del v&iacute;deo, de tal forma <span class="Estilo12"><strong>la repetici&oacute;n de la bandera a cuadros cayendo hacia abajo coincide con la repetici&oacute;n de notas de la m&uacute;sica de fondo</strong></span>, el clip en el que alonso tira la gorra al p&uacute;blico tambi&eacute;n coincide con la m&uacute;sica.</p>
<p><span class="Estilo8">Se ha hecho uso de transiciones</span> de un clip a otro para evitar una brusquedad en el v&iacute;deo y conseguir as&iacute; mas uniformidad en &eacute;ste, tambi&eacute;n se baja la m&uacute;sica al final del v&iacute;deo progresivamente a medida que &eacute;ste se va oscureciendo.</p>
<p>&nbsp;</p>
<p class="Estilo8">- Gimnasia:</p>
<p>  v&iacute;deo original: <a href="http://www.youtube.com/watch?v=V5gR0g8lHIs&amp;feature=related">http://www.youtube.com/watch?v=V5gR0g8lHIs&amp;feature=related</a></p>
<p>  montaje:	        con pinnacle Studio.</p>
<p>Inicialmente <span class="Estilo8">se ha introducido al v&iacute;deo un t&iacute;tulo</span> en el que pone &quot;gimnasia&quot; para hacer saber al usuario que la pregunta que tendr&aacute; que responder ser&aacute; de este deporte, este t&iacute;tulo va desapareciendo poco a poco mediante una transici&oacute;n hacia el siguiente clip, el cual se describe a continuaci&oacute;n: </p>
<p><span class="Estilo8">El v&iacute;deo original ha tenido que cortarse en varias partes,</span> primeramente se ha eliminado el principio del v&iacute;deo en el que aparece el nombre de Nadia comaneci, dejando solo desde  donde aparece el lugar y el a&ntilde;o donde se celebraron las olimpiadas (Montreal, 1976) hasta que Nadia termina su ejercicio. Aqu&iacute; hemos cortado de nuevo el v&iacute;deo (pues en el original vuelve a aparecer el nombre de Nadia), y hemos puesto al final un &uacute;ltimo clip que muestra la puntuaci&oacute;n de su ejercicio. El v&iacute;deo termina con una transici&oacute;n a un fondo negro. </p>
<p>&nbsp;</p>
<p class="Estilo8">- Breakdance: </p>
<p>  v&iacute;deo original: <a href="http://www.youtube.com/watch?v=JKQ83Bo9g3s">http://www.youtube.com/watch?v=JKQ83Bo9g3s</a></p>
<p>  Montaje:	        con pinnacle Studio</p>
<p>Al igual que en el  anterior v&iacute;deo <span class="Estilo8">se ha introducido al v&iacute;deo un t&iacute;tulo</span> en el que pone &quot;BreakDance&quot; para hacer saber al usuario que la pregunta que tendr&aacute; que responder ser&aacute; de este deporte, este t&iacute;tulo va desapareciendo poco a poco mediante una transici&oacute;n hacia el siguiente clip, el cual se describe a continuaci&oacute;n: </p>
<p>La estrategia utilizada para crear este v&iacute;deo ha sido la de cortar una peque&ntilde;a  introducci&oacute;n del original y a&ntilde;adir detr&aacute;s de &eacute;sta otro clip en el que aparece &quot;Hong10&quot; contando hasta 5 con los dedos, para as&iacute; crear mi propia introducci&oacute;n al v&iacute;deo mucho mas corta que la original; a continuaci&oacute;n se acopla un trozo del &quot;combate&quot; entre Lilou y Hong10, todos <span class="Estilo8">estos clips</span> se ponen uno detr&aacute;s de otro sin transiciones, pues <span class="Estilo12"><strong>est&aacute;n cortados de forma que se note m&iacute;nimamente que se producen cortes</strong></span>, el v&iacute;deo termina  con una transici&oacute;n a un fondo negro.</p>
<p>&nbsp;</p>
<p class="Estilo8">- Skate</p>
<p>  v&iacute;deos originales: <a href="http://www.youtube.com/watch?v=AUYhaFSlIuY&amp;feature=related">http://www.youtube.com/watch?v=AUYhaFSlIuY&amp;feature=related</a></p>
<p><a href="http://www.youtube.com/watch?v=TCFiTJKj9_E">http://www.youtube.com/watch?v=TCFiTJKj9_E</a></p>
<p>  montaje y m&uacute;sica al comp&aacute;s de la canci&oacute;n:    con windows movie maker</p>
<p>Este v&iacute;deo es el &uacute;nico realizado con windows movie maker, la raz&oacute;n es simplemente que deseaba aprender a utilizar distintos programas de montaje de v&iacute;deo y as&iacute;,  ampliar conocimientos.</p>
<p>Este v&iacute;deo tambi&eacute;n lleva un t&iacute;tulo, &quot;skate&quot; y  se basa en la m&uacute;sica de fondo que se le ha introducido para realizar las distintas transaciones a los siguientes clips. Tras el t&iacute;tulo se muestra el primer v&iacute;deo original, pero con variaciones en sus clips, manipulando la duraci&oacute;n de cada uno para conseguir que las frases vayan apareciendo justo en el momento en que se escucha a la voz de la m&uacute;sica de fondo. El v&iacute;deo termina con el 900&ordm; de Toni Hawk, pero este clip est&aacute; cortado del segundo v&iacute;deo original, pues tiene mucha m&aacute;s calidad visual que el primero (este clip va desde la &uacute;ltima frase en blanco y negro hasta el final del v&iacute;deo).</p>
<p>&nbsp;</p>
<p class="Estilo8">- Tenis:  </p>
<p>v&iacute;deos originales: <a href="http://www.youtube.com/watch?v=yM6gWYivNj4">http://www.youtube.com/watch?v=yM6gWYivNj4</a></p>
<p><a href="http://www.youtube.com/watch?v=61zFCxFx3Gw&amp;feature=related">http://www.youtube.com/watch?v=61zFCxFx3Gw&amp;feature=related</a></p>
<p><a href="http://www.youtube.com/watch?v=UryCKHGMkBk&amp;feature=related">http://www.youtube.com/watch?v=UryCKHGMkBk&amp;feature=related</a></p>
<p>  montaje y m&uacute;sica que comienza con el saque de federer:    con pinnacle Studio</p>
<p>El  v&iacute;deo comienza con un texto en el que pone &quot;tenis&quot; despu&eacute;s se sigue con un clip en el que aparece  Federer iniciando un saque, manipulado de tal forma que la m&uacute;sica comienza justo cuando &eacute;ste le pega a la pelota, despu&eacute;s se muestran los saques de Moy&aacute;, Nadal y Roddick todos estos obtenidos los distintos v&iacute;deos originales. Una vez mostrado el saque de cada uno se obtiene un fotograma de cada uno de ellos y se rotula un texto abajo con su nombre de distintos colores, finalmente se termina con un efecto  que incorpora Studio en el que la imagen se transforma en una pelota de tenis y una raqueta. Todo esto se consigue con herramientas que incorpora pinnacle Studio. Finalmente se va bajando el volumen de la m&uacute;sica a la vez que se oscurece el v&iacute;deo. </p>
<p>&nbsp;</p>
<p class="Estilo8">- Motociclismo: </p>
<p>  v&iacute;deos originales: <a href="http://www.youtube.com/watch?v=zhOpkWIWV98">http://www.youtube.com/watch?v=zhOpkWIWV98</a></p>
<p>  montaje y m&uacute;sica acorde con el v&iacute;deo:    con pinnacle Studio</p>
<p>Tras empezar con un texto en el que pone motociclismo se pasa al v&iacute;deo que se obtiene solapando fotogramas del v&iacute;deo original, de tal forma que d&aacute; la impresi&oacute;n de que se produce una &uacute;nica carrera, la m&uacute;sica est&aacute; obtenida de un videojuego de ordenador, y termina progresivamente a medida que el v&iacute;deo se oscurece.</p>
<p>&nbsp;</p>
<p class="Estilo8">- Dakar: </p>
<p>  v&iacute;deo original:      grabado por m&iacute;</p>
<p>  m&uacute;sica y montaje:    con pinnacle Studio</p>
<p>Tras empezar con un texto en el que pone dakar se pasa al v&iacute;deo grabado por nosotros mediante una transici&oacute;n, para grabar el v&iacute;deo se ha dibujado una moto y un hombre en papel para posteriormente recortarlos. Mientras uno de nosotros sujetaba la c&aacute;mara el otro pon&iacute;a al mu&ntilde;eco encima de la moto. El efecto de sonido de motor tambi&eacute;n ha sido grabado por m&iacute; con audacity y el montaje final se ha conseguido con pinnacle Studio.</p>
<p class="Estilo8">- Ajedrez: </p>
<p>  V&iacute;deo original: grabado por m&iacute;.    </p>
<p>  montaje:             con pinnacle Studio.</p>
<p>El prop&oacute;sito de este v&iacute;deo es que parezca antiguo, para ello <span class="Estilo8">se utiliza un filtro con Virtual dub para conseguir el efecto de blanco y negro</span>, este filtro se aplica cuando el v&iacute;deo ya est&aacute; completamente montado con el pinnacle.</p>
<p>Adem&aacute;s del efecto de blanco y negro, tambi&eacute;n se consigue un efecto de fondo negro y un foco blanco en el lugar concreto del tablero de ajedrez a donde se desea que el usuario preste su atenci&oacute;n, este efecto se consigue en la misma grabaci&oacute;n del v&iacute;deo, apagando la luz y alumbrando con una linterna en el lugar deseado.</p>
<p>La &uacute;nica modificaci&oacute;n que lleva este v&iacute;deo con respecto a la grabaci&oacute;n original es que se le ha introducido un t&iacute;tulo al principio que pone &quot;ajedrez&quot;. </p>
<p>&nbsp;</p>
<p class="Estilo8">- Mundial: </p>
<p>  v&iacute;deo original: <a href="http://www.youtube.com/watch?v=zEfmAw61pFY">http://www.youtube.com/watch?v=zEfmAw61pFY</a></p>
<p>  m&uacute;sica y montaje:    con pinnacle Studio</p>
<p>Tras el r&oacute;tulo donde aparece el texto mundial korea-Jap&oacute;n se obtiene un v&iacute;deo a partir del spot publicitario original, para terminar el v&iacute;deo lo hacemos congelando la imagen final del portero cuando le meten un gol y oscureciendo la imagen mientras se va bajando progresivamente la m&uacute;sica de fondo, la cual se ha incorporado al v&iacute;deo tambi&eacute;n eliminando la que hab&iacute;a originalmente.</p>
<p>&nbsp;</p>
<p class="Estilo8">- Baloncesto:</p>
<p>  v&iacute;deo original: <a href="http://www.youtube.com/watch?v=zaoVIfc3Rw4">http://www.youtube.com/watch?v=zaoVIfc3Rw4</a></p>
<p>m&uacute;sica y montaje:    con pinnacle Studio</p>
<p>Como siempre se inicia el v&iacute;deo con el texto &quot;Baloncesto&quot;, pasando por una transici&oacute;n hacia el v&iacute;deo montado, en el cual se han tenido que realizar diferentes modificaciones con respecto al original, inicialmente se ha congelado la imagen al principio de &eacute;ste y se ha rotulado en el centro de la imagen &quot;Atenci&oacute;n, intenta contar los pases de bal&oacute;n DEL EQUIPO BLANCO&quot; una vez mostrado esto se sigue con el flujo normal del v&iacute;deo, se introduce la m&uacute;sica y se termina con un efecto  incorporado en el que la imagen se transforma en un bal&oacute;n de baloncesto.</p>
<p><a href="#2">subir</a></p>
<p>&nbsp;</p>
<h1><strong><a name="2.2" id="2.2"></a>2.2 Contenidos de texto.</strong></h1>
<p>Entre los contenidos de texto realizados por Javier Fern&aacute;ndez Vivancos destacamos los siguientes: </p>
<p><a href="#2">subir</a></p>
<p>&nbsp;</p>
<h1><strong><a name="2.2.1" id="2.2.1"></a>2.2.1 Memoria. </strong></h1>
<p>El presente documento ha sido realizado en Macromedia Dreamweaver 8, usando el <span class="Estilo8">estilo definido por Jose Vicente Casanova Fern&aacute;ndez</span>, <span class="Estilo8">usando puntos de anclaje y v&iacute;nculos</span>. El color del texto y el subrayado en azul se ha escogido de este color pues al ser el fondo naranja, el color complementario a &eacute;ste en la paleta de colores es el azul, consiguiendo as&iacute; un mayor impacto visual en el subrayado. Cabe destacar la ayuda que han realizado Jose Vicente y Juan Francisco  para la realizaci&oacute;n de esta memoria, pues han realizado un informe de todo lo realizado en su parte del proyecto. </p>
<p><a href="#2">subir</a></p>
<p>&nbsp;</p>
<h1><strong><a name="2.3" id="2.3"></a>2.3 Contenidos de animaci&oacute;n. </strong></h1>
<p><span class="Estilo8">Los contenidos de animaci&oacute;n del proyecto han sido realizados por Javier Fern&aacute;ndez Vivancos</span>, en Macromedia Flash 8, entre los que destacamos los siguientes: </p>
<p><a href="#2">subir</a></p>
<p>&nbsp;</p>
<h1><a name="2.3.1" id="2.3.1"></a><strong>2.3.1 Presentaci&oacute;n del Juego</strong></h1>
<p>La presentaci&oacute;n del juego es lo segundo que aparece cuando iniciamos el juego,(lo primero es la introducci&oacute;n realizada por Jose Vicente) el presentador &quot;andando&quot; desde una esquina del escenario hasta el centro, y la elecci&oacute;n del usuario del personaje que le representar&aacute; durante el resto del juego, todo este proceso se describe en los 3 apartados siguientes: </p>
<p><span class="Estilo12"><strong>1) Inicialmente aparece la imagen que servir&aacute; de fondo</strong></span> durante el resto del juego,<span class="Estilo12"><strong> y el presentador caminando </strong></span>por la parte inferior de la pantalla  hasta pararse en el centro de &eacute;sta,<span class="Estilo4"> para poder conseguir hacer &quot;caminar&quot; al presentador ha sido necesaria la creaci&oacute;n de una animaci&oacute;n flash contenida dentro de otra, </span>es decir:</p>
<p>- primero se ha creado un clip de pel&iacute;cula flash (formato swf) que se encarga de girar al presentador de izquierda a derecha y de derecha a izquierda indefinidamente para as&iacute; dar la sencaci&oacute;n de que se mueve, este efecto se consigue mediante dos interpolaciones de movimiento, una para cuando se mueve hacia la derecha y otra para cuando se mueve hacia la izquierda.</p>
<p>- Una vez hecho esto importamos este clip al escenario principal y le a&ntilde;adimos una interpolaci&oacute;n de movimiento, desde la parte inferior derecha de la pantalla hasta la parte inferior central de &eacute;sta, as&iacute;, combinando este movimiento con el del apartado anterior conseguimos el efecto deseado, dar una sensaci&oacute;n de que el presentador &quot;camina&quot; hacia el centro de la pantalla. </p>
<p><span class="Estilo8">2)</span> Cuando <span class="Estilo8">el presentador</span> llega al centro de la pantalla, &eacute;ste se para e <span class="Estilo12"><strong>interact&uacute;a con el usuario</strong></span> mediante unos bocadillos, para conseguir hacer &quot;hablar&quot; al presentador se han seguido los siguientes pasos:</p>
<p>- Una vez que el presentador ya ha cruzado la pantalla y est&aacute; en el centro de &eacute;sta, se elimina el clip que mostraba al presentador movi&eacute;ndose de un lado a otro y se a&ntilde;ade una imagen pasiva del presentador en su lugar (sin movimiento)</p>
<p>- Cuando ya hemos hecho esto insertamos otro fotograma clave que contiene una copia del anterior y le importamos el bocadillo encima del mu&ntilde;eco, este fotograma lo alargamos el tiempo suficiente para que el bocadillo pueda ser leido con facilidad por el usuario, para introducir el resto de bocadillos repetimos este paso tantas veces como n&uacute;mero de bocadillos haya.</p>
<p><span class="Estilo8">3)</span> <span class="Estilo8">El final de la presentaci&oacute;n es cuando aparecen en escena los 4 personajes a elegir</span>, que se animan y nos hablan en bocadillos al estilo c&oacute;mic cuando ponemos el puntero del rat&oacute;n sobre ellos. Este efecto se describe a continuaci&oacute;n:</p>
<p>- Para conseguir el efecto de aparici&oacute;n de los personajes desde la parte superior de la pantalla cruz&aacute;ndose entre s&iacute; ha sido necesaria la creaci&oacute;n de 5 capas distintas, una por cada personaje y otra extra que contiene los objetos que no se mover&aacute;n mientras los personajes est&aacute;n apareciendo. En las 4 capas que contienen alg&uacute;n personaje se establece una interpolaci&oacute;n de movimiento, de tal forma que el fotograma clave inicial contiene una imagen pasiva de uno de los personajes afuera del escenario y el fotograma clave final contiene al personaje en su posici&oacute;n final.</p>
<p><a href="#2">subir</a></p>
<p>&nbsp; </p>
<h1><strong><a name="2.3.2" id="2.3.2"></a>2.3.2 Escenario del juego.</strong></h1>
<p><span class="Estilo8">El escenario del juego ha sido dise&ntilde;ado en Flash</span>, utilizando las herramientas de dibujo y texto que el programa incorpora, se ha utilizado una resoluci&oacute;n de 800 x 600 para as&iacute; evitar que ordenadores antiguos que no sean capaces de soportar altas resoluciones puedan visualizar el juego a pantalla completa, el fondo de &eacute;ste (azul con bola de 0 y 1) tambi&eacute;n ha sido buscado y seleccionado de internet por Javier.</p>
<p>Tambi&eacute;n <span class="Estilo8">se han creado los botones</span> para que el usuario seleccione la respuesta que desee, para la realizaci&oacute;n de estos botones, Javier ha <span class="Estilo8">utilizado gimp y audacity</span> para grabar los sonidos:</p>
<p>Inicialmente se han creado los botones con gimp con un tama&ntilde;o que nos permita trabajar con comodidad en el escenario del juego, cada uno de estos botones tiene cada uno un sonido distinto el cual se reproduce cuando el usuario pasa el rat&oacute;n por encima de &eacute;stos, estos sonidos se han grabado inicialmente con audacity y posteriormente se han incorporado al bot&oacute;n en su estado de &quot;sobre&quot; en flash.</p>
<p><a href="#2">subir</a></p>
<p>&nbsp;</p>
<h1><strong><a name="2.3.3" id="2.3.3"></a>2.3.3 Personajes </strong></h1>
<p>Para realizar las animaciones de cada personaje se ha utilizado flash, en total se han realizado unas 12 animaciones, tambi&eacute;n todos los personajes incorporan unos di&aacute;logos los cuales Javier ha creado con un programa llamado comic life para posteriormente incorporar en las animaciones que lo necesiten. Las animaciones se describen a continuaci&oacute;n:</p>
<p><span class="Estilo8">Jugador 1, Rodolfo:</span> para animar a Rodolfo <span class="Estilo8">se ha dividido la animaci&oacute;n en 4 capas,</span> una para los ojos, otra para la boca, otra para las cejas y otra para el mu&ntilde;eco (el fondo) el cual nunca cambia a lo largo de la animaci&oacute;n. Cada una de estas capas contiene lo que su propio nombre indica, y todas ellas (a excepci&oacute;n de la &uacute;ltima, la del fondo) <span class="Estilo8">realizan una interpolaci&oacute;n de forma </span> desde el fotograma inicial hasta el final, algunas de ellas con aceleraci&oacute;n para dar mas realismo al movimiento. Utilizando esta t&eacute;cnica se han obtenido 2 animaciones de Rodolfo, una en la que se pone triste y otra en la que se pone contento. </p>
<p><span class="Estilo8">Jugador 2, Jessica:</span> para animar a Jessica <span class="Estilo8">se ha dividido la animaci&oacute;n en 3 capas</span>, una para los ojos, otra para la boca,  y otra para el mu&ntilde;eco (el fondo) el cual nunca cambia a lo largo de la animaci&oacute;n. Cada una de estas capas contiene lo que su propio nombre indica, y todas ellas (a excepci&oacute;n de la &uacute;ltima, la del fondo) <span class="Estilo8">realizan una interpolaci&oacute;n de forma </span> desde el fotograma inicial hasta el final, para que la boca obtenga una animaci&oacute;n realista ha sido necesaria una primera interpolaci&oacute;n de forma la cual convierte sus labios en una l&iacute;nea, a partir de la cual es f&aacute;cil trabajar y obtener buenos resultados de animaci&oacute;n en la boca. Se han obtenido 2 animaciones de Jessica, una para ponerla triste y otra para ponerla normal, concretamente en la animaci&oacute;n de ponerla alegre se realizan hasta 3 interpolaciones de forma con sus ojos, para conseguir as&iacute; que se muevan de un lado a otro como si afirmase con los ojos. </p>
<p><span class="Estilo8">Jugador 3, Macarrilla:</span> <span class="Estilo8">Las animaciones de macarrilla usan 3 capas,</span> una para los ojos, otra para la boca y otra para el cuerpo (el fondo) el cual nunca cambia, <span class="Estilo8">cada una de estas capas tiene una interpolaci&oacute;n de forma </span>para conseguir el efecto deseado, con esta t&eacute;cnica se obtienen 2 animaciones: una para entristecer y otra para alegrar al personaje, concretamente la de entristecer tiene en el fotograma final dibujadas una venas en los ojos para dar sensaci&oacute;n de cabreo; esto se ha realizado con las herramientas de dibujo que incorpora flash. </p>
<p><span class="Estilo8">Jugador 4, Alexia:</span>  Para animar a Alexia <span class="Estilo8">se ha dividido la animaci&oacute;n en 4 capas</span>, una para los ojos, otra para la boca, otra para las cejas y otra para el mu&ntilde;eco (el fondo) el cual nunca cambia a lo largo de la animaci&oacute;n. Con esta estructura del mu&ntilde;eco se han obtenido 2 animaciones, una para entristecerla y otra para alegrarla. En la de alegrarla se usa<span class="Estilo8"> una &uacute;nica interpolaci&oacute;n de forma para la boca y cinco para las cejas</span>, &eacute;stas <span class="Estilo8">con aceleraci&oacute;n </span>para dar la impresi&oacute;n de que las levanta repetidamente, la capa de los ojos y la del cuerpo permanecen est&aacute;ticas. En la animaci&oacute;n de entristecer a Alexia se usa una interpolaci&oacute;n de forma para la boca y otra para las cejas, mientras que los ojos realizan 3 interpolaciones de movimiento para que den la impresi&oacute;n de que est&aacute;n negando.</p>
<p><span class="Estilo8">Presentador:</span> Las animaciones del presentador <span class="Estilo8">se consiguen dividiendo al personaje en 4 capas</span>, una para los ojos, otra para la boca, otra para las cejas y por &uacute;ltimo otra para el cuerpo. con esta estructura se han obtenido 4 animaciones: una para que levante la ceja, otra para que se alegre, otra para que se enfade y por &uacute;ltimo otra para moverlo de un lado hacia otro, esta &uacute;ltima se describe en el apartado 2.3.1. La animaci&oacute;n de levantar la ceja del presentador consta de <span class="Estilo8">2 interpolaciones de movimiento</span>, una para subir la ceja y otra para bajarla, mientras que el resto de capas permanecen est&aacute;ticas; la animaci&oacute;n para alegrarle usa como fotograma inicial y final las im&aacute;genes que Juan Francisco ha proporcionado, adem&aacute;s de esto las capas de los ojos y cejas usan una interpolaci&oacute;n de forma , mientras que el resto carecen de animaci&oacute;n. Por &uacute;ltimo la animaci&oacute;n de entristecer al presentador tiene una estructura similar a la de alegrarle. </p>
<p><a href="#2">subir</a></p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<h1><strong><a name="3" id="3"></a>3. Juan Francisco Cascales Garc&iacute;a, responsable de los contenidos de imagen y audio del proyecto.</strong></h1>
<p><strong><a href="#31">3.1 Contenidos de Imagen. </a></strong></p>
<p><strong><a href="#311">3.1.1 Programas utilizados para imagen. </a></strong></p>
<p><strong><a href="#312">3.1.2 Trabajo realizado por cada imagen. </a></strong></p>
<p><strong><a href="#32">3.2 Contenidos de audio. </a></strong></p>
<p><strong><a href="#3.2.1">3.2.1 Programas utilizados para audio.</a></strong></p>
<p><strong><a href="#3.2.2">3.2.2 Trabajo realizado por cada audio.</a></strong></p>
<p><strong><a href="#3.3">3.3 Anotaciones </a></strong></p>
<p>&nbsp;</p>
<h1><strong><a name="31" id="31"></a>3.1 Contenidos de imagen.</strong></h1>
<p>  <span class="Estilo8">Juan Francisco Cascales Garc&iacute;a</span><span class="Estilo12"><strong> ha sido el encargado de  trabajar con la mayor&iacute;a de las im&aacute;genes que aparecen en el proyecto</strong></span>, para ello  ha utilizado los programas que a continuaci&oacute;n se enuncian para retoque y  creaci&oacute;n de &eacute;stas, la mayor&iacute;a de ellas han sido buscadas y descargadas de Internet  (y todas las im&aacute;genes han sido retocadas y escaladas antes de pasar a formar  parte del proyecto).</p>
<p><a href="#3">Subir</a></p>
<p>&nbsp;</p>
<h1><strong><a name="311" id="311"></a>3.1.1 Programas utilizados para imagen. </strong></h1>
<p>  Gimp:</p>
<p>- Escalar correctamente las im&aacute;genes a un tama&ntilde;o en el que  nos sea posible trabajar con ellas. Aplicar fondos transparentes a las im&aacute;genes que lo  necesitan. </p>
<p>-
  Creaci&oacute;n de los t&iacute;tulos, logotipos y botones.</p>
<p>-
  Conversi&oacute;n al formato final de la imagen .</p>
<p>-
  Uso de diferentes filtros para modificar y dar un toque  &ldquo;profesional&rdquo; a algunas im&aacute;genes.</p>
<p>  Tambi&eacute;n se ha utilizado la p&aacute;gina <a href="../Escritorio/memoria%20sistemas%20multimedia/www.sp-studio.de">www.sp-studio.de</a> para la creaci&oacute;n de los personajes y sus distintas caras en las animaciones.</p>
<p><a href="#3">Subir</a></p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<h1><strong><a name="312" id="312"></a>3.1.2 Trabajo realizado por cada imagen.</strong></h1>
<p class="Estilo8">  - Personajes del juego: </p>
<p>El juego se compone de 5 personajes en total, (4  concursantes y un presentador). Cada personaje se compone de 3 im&aacute;genes, una  para cada estado de &aacute;nimo: normal, enfadado y alegre, todas ellas han sido  creadas en la p&aacute;gina <a href="http://www.sp-studio.de/">www.sp-studio.de</a>,  posteriormente se han descargado, escalado con un tama&ntilde;o de 270x270, y se les  ha puesto el fondo transparente.</p>
<p>  Cada uno de estos personajes ha sido guardado en un formato  distinto: Jugador 1 en PNG, Jugador 2 en GIF, Jugador 3 en JPEG, jugador 4 en  TIFF, presentador en BMP. </p>
<p>&nbsp;</p>
<p><span class="Estilo8">- Imagen que aparece mientras se responden las preguntas de  audio:</span><br />
  Descargada de Internet, escalada y se le ha puesto un  fondo transparente para mejorar su un mejor acople con el escenario del juego </p>
<p>&nbsp;</p>
<p class="Estilo8">- T&iacute;tulos:</p>
<p>  Creados y personalizados con gimp. El t&iacute;tulo de la p&aacute;gina  principal de la p&aacute;gina web
  en gris plateado y con relieve y con un cambio al pasar por encima el rat&oacute;n en 
  blanco y negro. T&iacute;tulo de ' Concursar en &quot;Las 3 jotas&quot; en verde y  negro con sombra 
relieve y reflejo.</p>
<p>&nbsp;</p>
<p class="Estilo8">- Botones:</p>
<p>  Botones de la p&aacute;gina web ('Inicio', 'Memoria', 'A  concursar') creados y personalizados 
con gimp con distinto efecto seg&uacute;n est&eacute; el bot&oacute;n sin pulsar, pasando el cursor  por encima o pulsado.</p>
<p>&nbsp;</p>
<p class="Estilo8">- Fondos:</p>
<p>  Buscados en Internet. Un fondo suave con el dibujo de un  puente (en amarillo) para 
el fondo de la p&aacute;gina web.</p>
<p>&nbsp;</p>
<p class="Estilo8">- Im&aacute;genes para cada pregunta (todas ellas escaladas a 270x270):</p>
<p><span class="Estilo8">Pregunta 21:</span> Imagen del logotipo de la NBA buscada de la p&aacute;gina oficial de la NBA (<a href="http://www.nba.com/">www.nba.com</a>) recortada de la original (wallpaper), <span class="Estilo12"><span class="Estilo4">modificada usando el </span><strong>filtro de esparcir</strong></span>.</p>
<p>  <span class="Estilo8">Pregunta 22:</span>  Imagen del logotipo de la NHL buscada de la p&aacute;gina oficial de la NHL (<a href="http://www.nhl.com/">www.nhl.com</a>) recortada de la original,<span class="Estilo4">  modificada usando un </span><span class="Estilo12"><strong>efecto ne&oacute;n suave</strong></span>.</p>
<p>  <span class="Estilo8">Pregunta 23:</span>  Fotograf&iacute;a del equipo nacional de Rusia de curling en una  competici&oacute;n sacada de <a href="http://www.wikipedia.org/">www.wikipedia.org</a>.</p>
<p>  <span class="Estilo8">Pregunta 24:</span>  Imagen de unos balones de varios deportes encontrada en images.google.es  <span class="Estilo12"><span class="Estilo4">modificada usando el </span><strong>filtro de foto antigua en un color sepia.</strong></span></p>
<p>  <span class="Estilo8">Pregunta 25:</span>  Fotograf&iacute;a de Ronaldo de Assis Moreira (Ronaldinho) en su  etapa en el Paris Saint Germain encontrada en images.google.es<span class="Estilo4"> modificada  usando el </span><span class="Estilo4"></span><span class="Estilo8">efecto de destello arriba a la izquierda.</span></p>
<p>  <span class="Estilo8">Pregunta 26:</span>  Fotograf&iacute;a de Josefa Beloki en un momento del Tour de  Francia del 2004 sacada de <a href="http://www.wikipedia.org/">www.wikipedia.org</a>.</p>
<p>  <span class="Estilo8">Pregunta 27:</span>  Imagen del escudo del equipo Club Atl&eacute;tico Voleibol  Murcia 2005 sacada de su p&aacute;gina oficial <a href="http://www.voleibolmurcia.net/">www.<strong>voleibolmurcia</strong>.net</a> y <span class="Estilo12"><span class="Estilo4">modificada usando el </span></span><span class="Estilo8">efecto de mosaico.</span></p>
<p>  <span class="Estilo8">Pregunta 28:</span>  Fotograf&iacute;a del equipo de Dinamarca de&nbsp; la Eurocopa de Balonmano sacada de <a href="http://www.marca.com/">www.marca.com</a> <span class="Estilo12"><span class="Estilo4">modificada usando el </span><strong>efecto de  papel de peri&oacute;dico</strong></span> con los colores del c&oacute;digo el RGB al m&iacute;nimo posible.</p>
<p>  <span class="Estilo8">Pregunta 29:</span>  Fotograf&iacute;a de Roger Federer realizando un golpe en el  torneo de Roland Garros de 2007, sacada de <a href="http://www.marca.com/">www.marca.com</a> modificada poniendo un <span class="Estilo8">fondo blanco para que resalte el jugador.</span></p>
<p>  <span class="Estilo8">Pregunta 30:</span>  Fotograf&iacute;a de Fernando Alonso tras acabar una carrera  siendo el vencedor de la misma en su etapa en Renault en el 2006, sacada de images.google.es  y modificada usando el <span class="Estilo8">efecto de pintura al &oacute;leo.</span></p>
<p><a href="#3">Subir</a></p>
<p>&nbsp;</p>
<h1><strong><a name="32" id="32"></a>3.2 Contenidos de audio</strong></h1>
<p><span class="Estilo8">Juan Francisco Cascales Garc&iacute;a</span><span class="Estilo12"><strong> ha sido el encargado de  trabajar con la mayor&iacute;a de los audios que aparecen en el proyecto</strong></span>, para ello  ha utilizado los programas que a continuaci&oacute;n se enuncian para retoque y  conversi&oacute;n a distintos formatos de &eacute;stos, la mayor&iacute;a de ellos han sido buscados, seleccionados y descargados de Internet  (algunos de ellos han sido retocados y convertidos antes de formar parte del proyecto) entre los que destacamos:</p>
<p>La canci&oacute;n de la introducci&oacute;n de Jose Vicente, junto con la que suena cuando el jugador gana (BSO Space jam) han sido seleccionadas por Juan Francisco. </p>
<p><a href="#3">Subir</a></p>
<p>&nbsp;</p>
<h1><a name="3.2.1" id="3.2.1"></a>3.2.1 Programas utilizados para audio </h1>
<p>Audacity:</p>
<p>- Conversi&oacute;n a distintos formatos de audio. </p>
<p>-
  Editar y retocar audio. </p>
<p><a href="#3">Subir</a></p>
<p>&nbsp;</p>
<h1><a name="3.2.2" id="3.2.2"></a>3.2.2 Trabajo realizado por cada audio </h1>
<p><span class="Estilo8">Pregunta 1:</span> (.mp3) <span class="Estilo8">transformada a mono</span>. Sonido de un bal&oacute;n de baloncesto botando en el suelo  sacada de la p&aacute;gina <a href="http://efectos-de-sonido.anuncios-radio.com">http://efectos-de-sonido.anuncios-radio.com</a></p>
<p> <span class="Estilo8">Pregunta 2:</span> (.mp3) <span class="Estilo8">transormada a mono</span>. Sonido de una plaza de toros mientras un torero da unos  pases y el p&uacute;blico aplaude encontrado en <a href="http://efectos-de-sonido.anuncios-radio.com">http://efectos-de-sonido.anuncios-radio.com</a></p>
<p> <span class="Estilo8">Pregunta 3:</span> (.mp3) <span class="Estilo8">transormada a mono.</span> Momento en el que un equipo de f&uacute;tbol tiene una  oportunidad de gol, lo mete y, acto seguido, el p&uacute;blico lo celebra con orgullo  sacado de <a href="http://efectos-de-sonido.anuncios-radio.com">http://efectos-de-sonido.anuncios-radio.com</a></p>
<p> <span class="Estilo8">Pregunta 4:</span> (transformada a .mp3), <span class="Estilo8">se le ha subido el tono, recortada con el audacity</span> para obtener s&oacute;lo el momento del estribillo. Afici&oacute;n del Liverpool F. C. cantando el  famoso himno que le cantan a sus jugadores antes de salir al campo, &ldquo;You&rsquo;ll  never walk alone&rdquo;.</p>
<p> <span class="Estilo12"><strong>Pregunta 5:</strong></span> (.wav) Sonido de un lanzamiento en una bolera que acaba haciendo  un strike cogido de la p&aacute;gina <a href="http://www.audiosparx.com">http://www.audiosparx.com</a></p>
<p> <span class="Estilo12"><strong>Pregunta 6:</strong></span> (.wav) Se escucha a un coche de formula 1 pasando cerca de unos  aficionados, sonido encontrado en la web <a href="http://www.audiosparx.com">http://www.audiosparx.com</a></p>
<p> <span class="Estilo8">Pregunta 7:</span> (.wav) Es el momento en el que un bateador de b&eacute;isbol consigue  hacer un home run tras batear un lanzamiento del pitcher del equipo contrario  sacado de <a href="http://www.audiosparx.com">http://www.audiosparx.com</a></p>
<p> <span class="Estilo8">Pregunta 8:</span> (.wav) Un golfista realiza un golpe perfecto que acaba siendo un  hoyo en uno escogida de la p&aacute;gina <a href="http://www.audiosparx.com">http://www.audiosparx.com</a></p>
<p> <span class="Estilo8">Pregunta 9:</span> (.wav) Sonido grabado cuando un nadador realiza el salto a la  piscina sacada de <a href="http://efectos-de-sonido.anuncios-radio.com/">http://efectos-de-sonido.anuncios-radio.com/</a></p>
<p> <span class="Estilo8">Pregunta 10:</span> (.wav) Momento en el que un jugador de billar consigue entronar  varias bolas de un solo golpe de la web <a href="http://www.audiosparx.com">http://www.audiosparx.com</a></p>
<p><span class="Estilo8">Gong chino:</span> el gong chino que se escucha al principio de cada nivel ha sido modificado de tal forma que tiene el sonido amplificado, debido a que no se escuchaba con claridad. </p>
<p><a href="#3">Subir</a></p>
<p>&nbsp;</p>
<h1><a name="3.3" id="3.3"></a>3.3 Anotaciones</h1>
<p>Preguntas de audio a las que les he modificado el formato  (a algunas) con el audacity.
  A las preguntas en formato .mp3 (preguntas 1, 2, y 3) est&aacute;n puestas para que  suenen 
  por un solo altavoz (mono). La pregunta 4, recortada con el audacity y subido  el tono est&aacute; transformada est&aacute; en .mp3 (es el himno del Liverpool F. C.) y las  otras est&aacute;n en formato .wav pero porque no se me ha ocurrido que m&aacute;s pod&iacute;a  cambiarle.</p>
<p>&nbsp;</p>
<p><a href="principal.html">VOLVER A PAGINA PRINCIPAL</a></p>
<p>&nbsp;</p>
<p><a href="#3">Subir</a></p>
</body>

</html>
